[
  {
    "id": "2602.24258v1",
    "title": "A model of tuberculosis progression using CompuCell3D",
    "authors": [
      "James W. G. Doran",
      "Christopher F. Rowlatt",
      "Gibin G. Powathil",
      "Ruth Bowness",
      "Christian A. Yates"
    ],
    "published_date": "2026-02-27T18:30:35Z",
    "abstract": "Tuberculosis (TB) is an airborne disease caused by the bacterium Mycobacterium tuberculosis (M. tb). Prior to the COVID-19 pandemic, TB was the leading cause of death from an infectious agent globally. However, most people exposed to M. tb do not develop active TB and go on to display symptoms. Instead, in the majority of cases, the bacteria are contained within a granuloma (an aggregation of immune cells) without being eliminated; this is called latent TB. The spatial organisation of the bacteria and immune cells is important in determining whether an individual exposed to M. tb will develop latent or active TB. In this paper, we present a multi-cell, multiscale model of TB progression to investigate the importance of the spatial organisation. This is a novel TB within-host dynamics modelling framework, having been developed using CompuCell3D (CC3D), an open-source computer software used for simulating cellular biological processes both within and between cells. We used this model to compare the generated results with those from a previously developed within-host infectious disease model. We found that, although the results of our CC3D model mostly agree qualitatively with those from the previously developed model, there are quantitative differences. Additionally, we conducted a robustness analysis of key model parameters from the CC3D model to determine their importance to the CC3D model output, using a methodology specifically designed for agent-based models. The model output appears to be robust in response to perturbations in parameters controlling chemotactic movement, but less so in response to perturbations in parameters controlling persistence of movement in cells, cell adhesion and volume constraints. This work compares our CC3D model of TB progression with another agent-based modelling approach to the same problem.",
    "pdf_link": "https://arxiv.org/pdf/2602.24258v1",
    "categories": [
      "q-bio.QM"
    ],
    "tldr": "A multiscale CompuCell3D agent-based model of tuberculosis reveals that spatial immune-cell organisation governs latent vs. active disease, with cell adhesion and movement persistence as the most influential parameters.",
    "keywords": [
      "Agent-Based Modeling (ABM)",
      "CompuCell3D (CC3D)",
      "Multiscale Modeling",
      "Robustness/Sensitivity Analysis",
      "Within-Host Infectious Disease Dynamics"
    ],
    "relevance_score": 7
  }
]