[
  {
    "id": "2602.16696v1",
    "title": "Parameter-free representations outperform single-cell foundation models on downstream benchmarks",
    "authors": [
      "Huan Souza",
      "Pankaj Mehta"
    ],
    "published_date": "2026-02-18T18:42:29Z",
    "abstract": "Single-cell RNA sequencing (scRNA-seq) data exhibit strong and reproducible statistical structure. This has motivated the development of large-scale foundation models, such as TranscriptFormer, that use transformer-based architectures to learn a generative model for gene expression by embedding genes into a latent vector space. These embeddings have been used to obtain state-of-the-art (SOTA) performance on downstream tasks such as cell-type classification, disease-state prediction, and cross-species learning. Here, we ask whether similar performance can be achieved without utilizing computationally intensive deep learning-based representations. Using simple, interpretable pipelines that rely on careful normalization and linear methods, we obtain SOTA or near SOTA performance across multiple benchmarks commonly used to evaluate single-cell foundation models, including outperforming foundation models on out-of-distribution tasks involving novel cell types and organisms absent from the training data. Our findings highlight the need for rigorous benchmarking and suggest that the biology of cell identity can be captured by simple linear representations of single cell gene expression data.",
    "pdf_link": "https://arxiv.org/pdf/2602.16696v1",
    "categories": [
      "q-bio.GN",
      "cs.LG",
      "q-bio.QM"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.16504v1",
    "title": "GRIMM: Genetic stRatification for Inference in Molecular Modeling",
    "authors": [
      "Ashley Babjac",
      "Adrienne Hoarfrost"
    ],
    "published_date": "2026-02-18T14:46:18Z",
    "abstract": "The vast majority of biological sequences encode unknown functions and bear little resemblance to experimentally characterized proteins, limiting both our understanding of biology and our ability to harness functional potential for the bioeconomy. Predicting enzyme function from sequence remains a central challenge in computational biology, complicated by low sequence diversity and imbalanced label support in publicly available datasets. Models trained on these data can overestimate performance and fail to generalize. To address this, we introduce GRIMM (Genetic stRatification for Inference in Molecular Modeling), a benchmark for enzyme function prediction that employs genetic stratification: sequences are clustered by similarity and clusters are assigned exclusively to training, validation, or test sets. This ensures that sequences from the same cluster do not appear in multiple partitions. GRIMM produces multiple test sets: a closed-set test with the same label distribution as training (Test-1) and an open-set test containing novel labels (Test-2), serving as a realistic out-of-distribution proxy for discovering novel enzyme functions. While demonstrated on enzymes, this approach is generalizable to any sequence-based classification task where inputs can be clustered by similarity. By formalizing a splitting strategy often used implicitly, GRIMM provides a unified and reproducible framework for closed- and open-set evaluation. The method is lightweight, requiring only sequence clustering and label annotations, and can be adapted to different similarity thresholds, data scales, and biological tasks. GRIMM enables more realistic evaluation of functional prediction models on both familiar and unseen classes and establishes a benchmark that more faithfully assesses model performance and generalizability.",
    "pdf_link": "https://arxiv.org/pdf/2602.16504v1",
    "categories": [
      "q-bio.QM"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.16357v1",
    "title": "Optical Inversion and Spectral Unmixing of Spectroscopic Photoacoustic Images with Physics-Informed Neural Networks",
    "authors": [
      "Sarkis Ter Martirosyan",
      "Xinyue Huang",
      "David Qin",
      "Anthony Yu",
      "Stanislav Emelianov"
    ],
    "published_date": "2026-02-18T10:44:45Z",
    "abstract": "Accurate estimation of the relative concentrations of chromophores in a spectroscopic photoacoustic (sPA) image can reveal immense structural, functional, and molecular information about physiological processes. However, due to nonlinearities and ill-posedness inherent to sPA imaging, concentration estimation is intractable. The Spectroscopic Photoacoustic Optical Inversion Autoencoder (SPOI-AE) aims to address the sPA optical inversion and spectral unmixing problems without assuming linearity. Herein, SPOI-AE was trained and tested on \\textit{in vivo} mouse lymph node sPA images with unknown ground truth chromophore concentrations. SPOI-AE better reconstructs input sPA pixels than conventional algorithms while providing biologically coherent estimates for optical parameters, chromophore concentrations, and the percent oxygen saturation of tissue. SPOI-AE's unmixing accuracy was validated using a simulated mouse lymph node phantom ground truth.",
    "pdf_link": "https://arxiv.org/pdf/2602.16357v1",
    "categories": [
      "cs.LG",
      "q-bio.QM"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.16004v1",
    "title": "Time-Varying Directed Interactions in Functional Brain Networks: Modeling and Validation",
    "authors": [
      "Nan Xu",
      "Xiaodi Zhang",
      "Wen-Ju Pan",
      "Jeremy L. Smith",
      "Eric H. Schumacher",
      "Jason W. Allen",
      "Vince D. Calhoun",
      "Shella D. Keilholz"
    ],
    "published_date": "2026-02-17T20:51:07Z",
    "abstract": "Understanding the dynamic nature of brain connectivity is critical for elucidating neural processing, behavior, and brain disorders. Traditional approaches such as sliding-window correlation (SWC) characterize time-varying undirected associations but do not resolve directional interactions, limiting inference about time-resolved information flow in brain networks. We introduce sliding-window prediction correlation (SWpC), which embeds a directional linear time-invariant (LTI) model within each sliding window to estimate time-varying directed functional connectivity (FC). SWpC yields two complementary descriptors of directed interactions: a strength measure (prediction correlation) and a duration measure (window-wise duration of information transfer). Using concurrent local field potential (LFP) and fMRI BOLD recordings from rat somatosensory cortices, we demonstrate stable directionality estimates in both LFP band-limited power and BOLD. Using Human Connectome Project (HCP) motor task fMRI, SWpC detects significant task-evoked changes in directed FC strength and duration and shows higher sensitivity than SWC for identifying task-evoked connectivity differences. Finally, in post-concussion vestibular dysfunction (PCVD), SWpC reveals reproducible vestibular-multisensory brain-state shifts and improves healthy-control vs subacute patient (HC-ST) discrimination using state-derived features. Together, these results show that SWpC provides biologically interpretable, time-resolved directed connectivity patterns across multimodal validation and clinical application settings, supporting both basic and translational neuroscience.",
    "pdf_link": "https://arxiv.org/pdf/2602.16004v1",
    "categories": [
      "q-bio.NC",
      "q-bio.QM"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.15740v1",
    "title": "MRC-GAT: A Meta-Relational Copula-Based Graph Attention Network for Interpretable Multimodal Alzheimer's Disease Diagnosis",
    "authors": [
      "Fatemeh Khalvandi",
      "Saadat Izadi",
      "Abdolah Chalechale"
    ],
    "published_date": "2026-02-17T17:15:32Z",
    "abstract": "Alzheimer's disease (AD) is a progressive neurodegenerative condition necessitating early and precise diagnosis to provide prompt clinical management. Given the paramount importance of early diagnosis, recent studies have increasingly focused on computer-aided diagnostic models to enhance precision and reliability. However, most graph-based approaches still rely on fixed structural designs, which restrict their flexibility and limit generalization across heterogeneous patient data. To overcome these limitations, the Meta-Relational Copula-Based Graph Attention Network (MRC-GAT) is proposed as an efficient multimodal model for AD classification tasks. The proposed architecture, copula-based similarity alignment, relational attention, and node fusion are integrated as the core components of episodic meta-learning, such that the multimodal features, including risk factors (RF), Cognitive test scores, and MRI attributes, are first aligned via a copula-based transformation in a common statistical space and then combined by a multi-relational attention mechanism. According to evaluations performed on the TADPOLE and NACC datasets, the MRC-GAT model achieved accuracies of 96.87% and 92.31%, respectively, demonstrating state-of-the-art performance compared to existing diagnostic models. Finally, the proposed model confirms the robustness and applicability of the proposed method by providing interpretability at various stages of disease diagnosis.",
    "pdf_link": "https://arxiv.org/pdf/2602.15740v1",
    "categories": [
      "cs.LG",
      "cs.AI",
      "q-bio.QM"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.15677v1",
    "title": "CAMEL: An ECG Language Model for Forecasting Cardiac Events",
    "authors": [
      "Neelay Velingker",
      "Alaia Solko-Breslin",
      "Mayank Keoliya",
      "Seewon Choi",
      "Jiayi Xin",
      "Anika Marathe",
      "Alireza Oraii",
      "Rajat Deo",
      "Sameed Khatana",
      "Rajeev Alur",
      "Mayur Naik",
      "Eric Wong"
    ],
    "published_date": "2026-02-17T16:02:52Z",
    "abstract": "Electrocardiograms (ECG) are electrical recordings of the heart that are critical for diagnosing cardiovascular conditions. ECG language models (ELMs) have recently emerged as a promising framework for ECG classification accompanied by report generation. However, current models cannot forecast future cardiac events despite the immense clinical value for planning earlier intervention. To address this gap, we propose CAMEL, the first ELM that is capable of inference over longer signal durations which enables its forecasting capability. Our key insight is a specialized ECG encoder which enables cross-understanding of ECG signals with text. We train CAMEL using established LLM training procedures, combining LoRA adaptation with a curriculum learning pipeline. Our curriculum includes ECG classification, metrics calculations, and multi-turn conversations to elicit reasoning. CAMEL demonstrates strong zero-shot performance across 6 tasks and 9 datasets, including ECGForecastBench, a new benchmark that we introduce for forecasting arrhythmias. CAMEL is on par with or surpasses ELMs and fully supervised baselines both in- and out-of-distribution, achieving SOTA results on ECGBench (+7.0% absolute average gain) as well as ECGForecastBench (+12.4% over fully supervised models and +21.1% over zero-shot ELMs).",
    "pdf_link": "https://arxiv.org/pdf/2602.15677v1",
    "categories": [
      "cs.LG",
      "q-bio.QM"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.15451v1",
    "title": "Molecular Design beyond Training Data with Novel Extended Objective Functionals of Generative AI Models Driven by Quantum Annealing Computer",
    "authors": [
      "Hayato Kunugi",
      "Mohsen Rahmani",
      "Yosuke Iyama",
      "Yutaro Hirono",
      "Akira Suma",
      "Matthew Woolway",
      "Vladimir Vargas-Calderón",
      "William Kim",
      "Kevin Chern",
      "Mohammad Amin",
      "Masaru Tateno"
    ],
    "published_date": "2026-02-17T09:38:11Z",
    "abstract": "Deep generative modeling to stochastically design small molecules is an emerging technology for accelerating drug discovery and development. However, one major issue in molecular generative models is their lower frequency of drug-like compounds. To resolve this problem, we developed a novel framework for optimization of deep generative models integrated with a D-Wave quantum annealing computer, where our Neural Hash Function (NHF) presented herein is used both as the regularization and binarization schemes simultaneously, of which the latter is for transformation between continuous and discrete signals of the classical and quantum neural networks, respectively, in the error evaluation (i.e., objective) function. The compounds generated via the quantum-annealing generative models exhibited higher quality in both validity and drug-likeness than those generated via the fully-classical models, and was further indicated to exceed even the training data in terms of drug-likeness features, without any restraints and conditions to deliberately induce such an optimization. These results indicated an advantage of quantum annealing to aim at a stochastic generator integrated with our novel neural network architectures, for the extended performance of feature space sampling and extraction of characteristic features in drug design.",
    "pdf_link": "https://arxiv.org/pdf/2602.15451v1",
    "categories": [
      "q-bio.QM",
      "cs.AI",
      "cs.LG",
      "quant-ph"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.14828v1",
    "title": "Exploring the limits of pre-trained embeddings in machine-guided protein design: a case study on predicting AAV vector viability",
    "authors": [
      "Ana F. Rodrigues",
      "Lucas Ferraz",
      "Laura Balbi",
      "Pedro Giesteira Cotovio",
      "Catia Pesquita"
    ],
    "published_date": "2026-02-16T15:21:11Z",
    "abstract": "Effective representations of protein sequences are widely recognized as a cornerstone of machine learning-based protein design. Yet, protein bioengineering poses unique challenges for sequence representation, as experimental datasets typically feature few mutations, which are either sparsely distributed across the entire sequence or densely concentrated within localized regions. This limits the ability of sequence-level representations to extract functionally meaningful signals. In addition, comprehensive comparative studies remain scarce, despite their crucial role in clarifying which representations best encode relevant information and ultimately support superior predictive performance. In this study, we systematically evaluate multiple ProtBERT and ESM2 embedding variants as sequence representations, using the adeno-associated virus capsid as a case study and prototypical example of bioengineering, where functional optimization is targeted through highly localized sequence variation within an otherwise large protein. Our results reveal that, prior to fine-tuning, amino acid-level embeddings outperform sequence-level representations in supervised predictive tasks, whereas the latter tend to be more effective in unsupervised settings. However, optimal performance is only achieved when embeddings are fine-tuned with task-specific labels, with sequence-level representations providing the best performance. Moreover, our findings indicate that the extent of sequence variation required to produce notable shifts in sequence representations exceeds what is typically explored in bioengineering studies, showing the need for fine-tuning in datasets characterized by sparse or highly localized mutations.",
    "pdf_link": "https://arxiv.org/pdf/2602.14828v1",
    "categories": [
      "q-bio.QM",
      "cs.LG"
    ],
    "affiliations": ["Unknown"]
  },
  {
    "id": "2602.14616v1",
    "title": "Higher-Order Hit-&-Run Samplers for Linearly Constrained Densities",
    "authors": [
      "Richard D. Paul",
      "Anton Stratmann",
      "Johann F. Jadebeck",
      "Martin Beyß",
      "Hanno Scharr",
      "David Rügamer",
      "Katharina Nöh"
    ],
    "published_date": "2026-02-16T10:20:52Z",
    "abstract": "Markov chain Monte Carlo (MCMC) sampling of densities restricted to linearly constrained domains is an important task arising in Bayesian treatment of inverse problems in the natural sciences. While efficient algorithms for uniform polytope sampling exist, much less work has dealt with more complex constrained densities. In particular, gradient information as used in unconstrained MCMC is not necessarily helpful in the constrained case, where the gradient may push the proposal's density out of the polytope. In this work, we propose a novel constrained sampling algorithm, which combines strengths of higher-order information, like the target's log-density's gradients and curvature, with the Hit-&-Run proposal, a simple mechanism which guarantees the generation of feasible proposals, fulfilling the linear constraints. Our extensive experiments demonstrate improved sampling efficiency on complex constrained densities over various constrained and unconstrained samplers.",
    "pdf_link": "https://arxiv.org/pdf/2602.14616v1",
    "categories": [
      "stat.CO",
      "q-bio.QM",
      "stat.AP"
    ],
    "affiliations": ["Unknown"]
  }
]